namespace Task
{
    class Menu
    {
        public void returnMenu0()
        {
            Console.WriteLine(
                "\n\t Приветствую! Выберете пожалуйста задачу для проверки:\n" +
                "\n" +
                "1. Задача No 34:\n" +
                "\t Задайте массив заполненный случайными положительными трёхзначными числами.\n" +
                "\t Напишите программу, которая покажет количество чётных чисел в массиве.\n" +
                "\n" +
                "2. Задача No 36:\n" +
                "\t Задайте одномерный массив, заполненный случайными числами.\n" +
                "\t Найдите сумму элементов, стоящих на нечётных позициях.\n" +
                "\n" +
                "3. Задача No 38:\n" +
                "\t Задайте массив вещественных чисел.\n" +
                "\t Найдите разницу между максимальным и минимальным элементов массива.\n" +
                "\n" +
                "Введите номер пункта для перехода к задаче или q для выхода из программы:");
        }
    }
}